# OASIS INFOBYTE DATASCIENCE INTERNSHIP
## TASK 3 - CAR PRICE PREDICTION WITH MACHINE LEARNING
## AUTHOR - RITIKA ROY CHOWDHURY

### INCLUDING REQUIRED PACKAGES

In [14]:
#importing basic libraries
import numpy as np
import pandas as pd

In [16]:
#reading the dataset

df=pd.read_csv('Downloads/cars_price.csv')

In [17]:
df.sample(5)

,name,company,year,Price,kms_driven,fuel_type
120,urgent sell my Mahindra qu,urgent,o c4,"3,50,000",NaN,NaN
179,Toyota Qualis,Toyota,2003,"1,80,000","1,00,000 kms",Diesel
40,Renault Duster 85 PS RxE Diesel,Renault,2013,"4,89,999","27,000 kms",Diesel
203,Toyota Corolla Altis,Toyota,2009,"3,00,000","1,32,000 kms",Petrol
155,Ford Endeavor 4x4 Thunder Plus,Ford,2019,"29,00,000","9,000 kms",Diesel

In [18]:
backup=df.copy()

In [19]:
df.describe()

,name,company,year,Price,kms_driven,fuel_type
count,209,209,209,209,185,183
unique,166,33,43,104,94,2
top,Maruti Suzuki Alto 800 Lx,Maruti,2015,Ask For Price,"60,000 kms",Petrol
freq,5,58,21,16,10,100

In [20]:
#cheking for Null Values
df.isna().sum()

name           0
company        0
year           0
Price          0
kms_driven    24
fuel_type     26
dtype: int64

In [21]:
#removing the Null data
df=df[~df['fuel_type'].isna()]

In [22]:
#reseting the index after droping
df.reset_index(drop=True)

,name,company,year,Price,kms_driven,fuel_type
0,Hyundai Santro Xing XO eRLX Euro III,Hyundai,2007,"80,000","45,000 kms",Petrol
1,Mahindra Jeep CL550 MDI,Mahindra,2006,"4,25,000",40 kms,Diesel
2,Maruti Suzuki Alto 800 Vxi,Maruti,2018,Ask For Price,"22,000 kms",Petrol
3,Hyundai Grand i10 Magna 1.2 Kappa VTVT,Hyundai,2014,"3,25,000","28,000 kms",Petrol
4,Ford EcoSport Titanium 1.5L TDCi,Ford,2014,"5,75,000","36,000 kms",Diesel
...,...,...,...,...,...,...
178,Maruti Suzuki Ritz VXI ABS,Maruti,2011,"2,70,000","50,000 kms",Petrol
179,Tata Indica V2 DLE BS III,Tata,2009,"1,10,000","30,000 kms",Diesel
180,Toyota Corolla Altis,Toyota,2009,"3,00,000","1,32,000 kms",Petrol
181,Tata Zest XM Diesel,Tata,2018,"2,60,000","27,000 kms",Diesel
182,Mahindra Quanto C8,Mahindra,2013,"3,90,000","40,000 kms",Diesel

In [23]:
#Removing non year from Year Column

df=df[df['year'].str.isnumeric()]

In [24]:
# making year as numeric

df['year']=df['year'].astype(int)

In [25]:
# changing "Ask for Price" rather removing them from price column

df=df[df['Price']!="Ask For Price"]

In [26]:
# making price as int type

df['Price']=df['Price'].str.replace(',','').astype(int)

In [27]:
# removing "," & "kms" from kms-driven column

df['kms_driven']=df['kms_driven'].str.split(' ').str.get(0).str.replace(',','')

In [28]:
# making kms_driven column as int type

df=df[df['kms_driven'].str.isnumeric()]
df['kms_driven']=df['kms_driven'].astype(int)

In [29]:
# slicing the car name to 3 words only

df['name']=df['name'].str.split(' ').str.slice(0,3).str.join(' ')

In [30]:
df.head()

                     name   company  year   Price  kms_driven fuel_type
0     Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1     Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
3       Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
4  Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
6               Ford Figo      Ford  2012  175000       41000    Diesel

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 174 entries, 0 to 206
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        174 non-null    object
 1   company     174 non-null    object
 2   year        174 non-null    int32
 3   Price       174 non-null    int32
 4   kms_driven  174 non-null    int32
 5   fuel_type   174 non-null    object
dtypes: int32(3), object(3)
memory usage: 7.5+ KB

In [32]:
#restetting the indexes again

df.reset_index(drop=True)

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
169      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
170          Tata Indica V2      Tata  2009  110000       30000    Diesel
171    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
172            Tata Zest XM      Tata  2018  260000       27000    Diesel
173      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[174 rows x 6 columns]

In [33]:
#statistical analysis

df.describe()

              year         Price     kms_driven
count   174.000000  1.740000e+02     174.000000
mean   2012.321839  3.298109e+05   46162.563218
std       4.418810  3.171166e+05   31019.500728
min    1995.000000  3.000000e+04       0.000000
25%    2009.000000  1.300000e+05   27000.000000
50%    2013.000000  2.650000e+05   40000.000000
75%    2016.000000  4.225000e+05   60000.000000
max    2019.000000  2.900000e+06  150000.000000

In [34]:
#outlier removal

df=df[df['Price']<6e6].reset_index(drop=True)
df

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
2         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
3    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
4                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
169      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
170          Tata Indica V2      Tata  2009  110000       30000    Diesel
171    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
172            Tata Zest XM      Tata  2018  260000       27000    Diesel
173      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[174 rows x 6 columns]

In [35]:
#make separate input and output data colums

x=df.drop(columns='Price')
y=df['Price']

In [36]:
# differentiate training and testing data

from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [37]:
y_train.head()

123    375000
154    325000
29     250000
24     190000
135    750000
Name: Price, dtype: int32

In [38]:
x_train.head()

                     name   company  year  kms_driven fuel_type
123      Mahindra Xylo E8  Mahindra  2010       40000    Diesel
154    Mahindra Quanto C4  Mahindra  2013       63000    Diesel
29   Mahindra Scorpio S10  Mahindra  2015       48508    Diesel
24     Maruti Suzuki Alto    Maruti  2017       72000    Petrol
135     Toyota Innova 2.5    Toyota  2011       75000    Diesel

In [39]:
#'name','company','fuel_type' columns are categorical so we need to make them neumeric

from sklearn.preprocessing import OneHotEncoder, StandardScaler
df1=OneHotEncoder()
df1.fit(df[['name','company','fuel_type']])

OneHotEncoder()

In [40]:
from sklearn.compose import make_column_transformer
column_trans= make_column_transformer((OneHotEncoder(categories=df1.categories_),['name','company','fuel_type']),
                                     remainder='passthrough')

In [41]:
# applying necessities for models
from xgboost import XGBRegressor
from sklearn.metrics import mean_squared_error,r2_score

import math
from sklearn.pipeline import make_pipeline

In [45]:
#XGB regressor

xgbr= XGBRegressor()
pipe=make_pipeline(column_trans,xgbr)
pipe.fit(x_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(categories=[array(['Audi A8', 'Audi Q7', 'Chevrolet Beat LS', 'Chevrolet Sail 1.2',
       'Chevrolet Spark LS', 'Chevrolet Tavera LS',
       'Chevrolet Tavera Neo', 'Datsun Go Plus', 'Datsun Redi GO',
       'Fiat Linea Emotion', 'Ford EcoSport Ambiente',
       'Ford EcoSport Titaniu...
                              feature_types=None, gamma=None, gpu_id=None,
                              grow_policy=None, importance_type=None,
                              interaction_constraints=None, learning_rate=None,
                              max_bin=None, max_cat_threshold=None,
                              max_cat_to_onehot=None, max_delta_step=None,
                              max_depth=None, max_leaves=None,
                              min_child_weight=None, missing=nan,
                              monotone_constraints=None, n_estimators=100,
                              n_jobs=None, num_parallel_tree=None,
                              predictor=None, random_state=None, ...))])

In [46]:
y_pred_xgbr=pipe.predict(x_test)
r2=r2_score(y_test,y_pred_xgbr)
r2

0.07205588951045239

In [47]:
#let's run XGBRegression for 50 times and store the highest scores

score=[]
for i in range(50):
    x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=i)
    xgbr=XGBRegressor()
    pipe=make_pipeline(column_trans,xgbr)
    pipe.fit(x_train,y_train)
    y_pred=pipe.predict(x_test)
    score.append(r2_score(y_test,y_pred))
score[np.argmax(score)]

0.6173565891140949

In [48]:
#saving according to the best item

x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=np.argmax(score))
xgbr=XGBRegressor()
pipe=make_pipeline(column_trans,xgbr)
pipe.fit(x_train,y_train)
y_pred=pipe.predict(x_test)
r2_score(y_test,y_pred)

0.6173565891140949

In [50]:
# testing our model prediction

pipe.predict(pd.DataFrame([['Maruti Suzuki Swift','Maruti',2019,100,'Petrol']],
            columns=['name','company','year','kms_driven','fuel_type']))

array([395510.6], dtype=float32)

In [51]:
pipe.predict(pd.DataFrame([['Ford Figo','Ford',2014,175000,'Diesel']],
            columns=['name','company','year','kms_driven','fuel_type']))

array([174579.97], dtype=float32)

In [53]:
 #Saving the model

import pickle
pickle.dump(pipe,open('car_price.pkl','wb'))

# THANK YOU